{
  "previousJobs": "Emplois Précédents",
  "header": {
    "home": "Accueil",
    "jobs": "Emplois",
    "resume": "CV",
    "projects": "Projets"
  },
  "intro": {
    "hello": "Bonjour, je suis",
    "name": "Oussama",
    "part1": "Salut, je suis un étudiant en troisième année de génie logiciel à l'Université Concordia.",
    "part2": "Avec une passion pour les solutions logicielles innovantes, mon expérience comprend Java, JavaScript, React et Python. Je souhaite devenir un développeur full-stack et j'ai hâte de travailler avec d'autres pour créer des logiciels impactants. J'aime également explorer l'intersection de l'informatique et des mathématiques discrètes.",
    "part3": "Je suis ravi de collaborer avec d'autres professionnels du développement logiciel pour créer des solutions innovantes qui font la différence."
  },
  "tooltip": {
    "lion": "Oussama est d'origine arabe et signifie \"lion\"."
  },
  "jobs": [
    {
      "id": 1,
      "title": "DevOps Full Ftack Developer Intern",
      "company": "Valsoft",
      "companyLink": "https://www.linkedin.com/company/valsoft-corporation/",
      "logo": "/images/Valsoft_logo.png",
      "dates": "mai 2023 - présent",
      "description": [""]
    },
{
  "id": 2,
  "title": "Stagiaire en Génie Logiciel",
  "company": "GoodFood",
  "companyLink": "https://www.linkedin.com/company/goodfood-market/",
  "logo": "/images/GoodFood_logo2.png",
  "dates": "Avril 2022 - Août 2022",
  "description": [
    "En tant que stagiaire développeur de logiciels chez GoodFood, j'ai joué un rôle essentiel dans le développement et la mise en œuvre de solutions logicielles personnalisées pour rationaliser les opérations, améliorer la communication et renforcer l'efficacité de divers départements de l'entreprise. Mes principales responsabilités comprenaient :",
    "Collaboration avec des équipes interfonctionnelles pour recueillir les exigences, identifier les points de douleur et proposer des solutions axées sur la technologie adaptées à leurs besoins.",
    "Développement d'applications web en utilisant Google Apps Script, JavaScript et des intégrations d'API pour automatiser les processus, améliorer la visualisation des données et faciliter la communication en temps réel.",
    "Mise en place d'un système de rapport de maintenance/nettoyage, qui comprenait une interface web conviviale pour que les opérateurs de machines signalent les problèmes et un bot Slack pour notifier le personnel concerné, améliorant ainsi le temps de réponse et l'efficacité globale des équipements.",
    "Création d'un outil de planification de matériel, qui a consolidé les données de plusieurs Google Sheets et les a présentées dans un format visuellement attrayant et facile à comprendre.",
    "Itération continue sur les solutions existantes, incorporation des commentaires des utilisateurs pour affiner les fonctionnalités et la fonctionnalité pour mieux répondre aux besoins des parties prenantes internes.",
    "Démonstration de solides compétences en résolution de problèmes et en communication tout au long du stage, conduisant à une exécution réussie du projet et à une meilleure collaboration entre les équipes."
  ],
  "jobSkills": ["JavaScript","Développement d'Applications Web", "Google Apps Script", "Intégrations d'API", "Visualisation des Données", "Intégration de Bot Slack", "Google Sheets", "Résolution de Problèmes", "Communication", "Automatisation Google Sheets", "HTML5", "Gestion des Stocks"]
}
  ],
  "featuredProjects": "Projets en Vedette",
  "completed": "Terminé",
  "github": "GitHub",
  "skills": "Compétences",
  "projects": [
    {
      "id": 1,
      "title": "Professional Networking Platform",
      "description": "Une plateforme de réseautage inspirée de LinkedIn, conçue pour connecter les professionnels et promouvoir la collaboration, avec une interface utilisateur moderne et des fonctionnalités pour améliorer la productivité.",
      "icon": "🌐",
      "time": "avril 2023",
      "projectLink": "https://github.com/OussamaJmili/Professional-Networking-Platform",
      "skills": [
        "ReactJS",
        "Redux",
        "Firebase",
        "Firestore",
        "Design Réactif",
        "Architecture Évolutive"
      ]
    },
    {
      "id": 2,
      "title": "ShopBright",
      "description": "Un site web de commerce électronique conçu pour offrir un traitement des paiements rapide et sécurisé, ainsi qu'une expérience utilisateur fluide pour les acheteurs.",
      "icon": "🛍️",
      "time": "avril 2022",
      "projectLink": "https://github.com/OussamaJmili/ShopBright",
      "skills": [
        "ReactJS",
        "Firebase",
        "Stripe",
        "Design Réactif",
        "Architecture Évolutive"
      ]
    },
    {
      "id": 3,
      "title": "LingoZone",
      "description": "Un site Web conçu pour présenter les services et les offres du centre de langues, destiné à attirer des étudiants potentiels et à promouvoir le centre auprès d'un public plus large.",
      "icon": "🌍",
      "time": "octobre 2020",
      "projectLink": "https://github.com/OussamaJmili/LingoZone",
      "skills": [
        "HTML",
        "CSS",
        "Bootstrap",
        "PHP",
        "Design Réactif",
        "Conception d'Interface Utilisateur"
      ]
    }
  ],
  "education": {
    "title": "Éducation",
    "data": [
      {
        "id": 1,
        "institution": "Université Concordia",
        "degree": "Baccalauréat en génie - Génie logiciel",
        "dates": "2020 - présent"
      }
    ]
  },
  "footer": {
    "copyright": "© {{year}} Oussama Jmili. Tous droits réservés.",
    "linkedin": "LinkedIn",
    "github": "GitHub",
    "email": "Email"
  },
    "resume": {
      "downloadResume": "Télécharger le CV",
      "name": "Oussama Jmili",
      "title": "Étudiant en Ingénierie Logicielle",
      "contactEmail": "oussamajmili16@gmail.com",
      "contactPhone": "+1 438 508 46 15",
      "contactWebsite": "oussamajmili.com",
      "contactLinkedin": "oussama-jmili",
      "contactGithub": "OussamaJmili",
      "intro": "Étudiant en ingénierie logicielle de troisième année, hautement motivé et désireux de saisir les opportunités pour apprendre et acquérir une expérience pratique dans le domaine.",
      "skillsTitle": "RÉSUMÉ DES COMPÉTENCES ET QUALIFICATIONS",
      "skills": [
        "Systèmes d'exploitation: Windows, Linux, Android",
        "Applications: Word, Excel, PPT, Eclipse, Adobe, Visual Studio Code",
        "Programmation: Java, Html, CSS, C, C#, JavaScript, Python, React, Lisp, Prolog, GitHub, Git, Agile",
        "Langues: Français, Anglais, Arabe (Standard & Marocain), Japonais",
        "Licences & Certifications: Permis de conduire valide, Certificat de prise de parole en public"
      ],
      "educationTitle": "Éducation",
      "education": {
        "degree": "Baccalauréat en Ingénierie Logicielle (Co-op) ",
        "university": "Université Concordia, Montréal, QC",
        "dates": "2020 - 2024",
        "coursesLabel": "Cours Pertinents",
        "coursesList": [
          "COMP 248-249 | Programmation OOP",
          "COMP 352 | Structures de Données & Algorithmes"
        ]
      },
      "workTitle": "Expérience Professionnelle",
      "work": {
        "role": "Stagiaire, Ingénieur Logiciel ",
        "company": "GoodFood, ",
        "location": "Montréal, QC, CA",
        "dates": "Mai 2022 - Août 2022",
        "tasks": [
          "Développement d'une application web pour suivre la planification des protéines et obtenir des données statistiques pour les prévisions futures en utilisant Google Apps Scripts avec HTML/CSS/JS.",
          "Création de bots Slack pour automatiser les rapports d'installation et la maintenance/nettoyage des machines en utilisant Slack Apps et JS.",
          "Écriture de scripts pour le département d'inspection pour suivre la maintenance des machines chaque semaine et rapporter automatiquement dans Google Sheet.",
          "Développement d'une application web pour trouver la perte dans la planification des matériaux et afficher les erreurs au directeur de l'automatisation.",
          "Révision et correction de l'ancien code pour inclure plus de fonctionnalités et prendre moins de temps/mémoire."
        ],
        "skills": ["JavaScript", "Développement d'Applications Web", "Google Apps Script", "Intégrations API", "Visualisation de Données", "Intégration de Bot Slack", "Google Sheets", "Résolution de Problèmes", "Communication", "Automatisation de Google Sheets", "HTML5", "Gestion des Stocks"]
      },
      "projectsTitle": "Projets",
    "projects": [
      {
        "name": "Plateforme de Réseautage Professionnel",
        "link": "https://github.com/OussamaJmili/Professional-Networking-Platform",
        "date": "Avril 2023",
        "description": "Une plateforme inspirée de LinkedIn pour les connexions et collaborations professionnelles.",
        "tasks": ["Développement d'une plateforme de réseautage utilisant ReactJS, Redux et Firebase pour connecter les professionnels et promouvoir la collaboration."],
        "skills": ["ReactJS", "Redux", "Firebase", "Firestore", "Design Responsive", "Architecture Évolutive"]
      },
      {
        "name": "ShopBright",
        "link": "https://github.com/OussamaJmili/ShopBright",
        "date": "Avril 2022",
        "description": "Un site web de commerce électronique semblable à Amazon pour une expérience de shopping en ligne sans faille, pratique et sécurisée.",
        "tasks": ["Développement d'un site web de commerce électronique complet utilisant ReactJS et Firebase, facilitant une expérience de navigation et d'achat transparente."],
        "skills": ["ReactJS", "Bootstrap", "Firebase", "HTML", "CSS", "JavaScript"]
      }
    ]
  }
}